Microchip-MPLAB-Harmony/reference_apps/apps/pic32cz_ca80_cult/pic32cz_ca80_getting_started_ext/firmware/src/packs/PIC32CZ8110CA80208_DFP/component/usbhs.h
/* -------- USBHS_INTFLAG : (USBHS Offset: 0x14) (R/W 32) USBHS Interrupt Flag Register -------- */
#define USBHS_INTFLAG_RESETVALUE              _UINT32_(0x00)                                       /*  (USBHS_INTFLAG) USBHS Interrupt Flag Register  Reset Value */

#define USBHS_INTFLAG_WAKEUP_Pos              _UINT32_(0)                                          /* (USBHS_INTFLAG) USB Activity Detection Interrupt Position */
#define USBHS_INTFLAG_WAKEUP_Msk              (_UINT32_(0x1) << USBHS_INTFLAG_WAKEUP_Pos)          /* (USBHS_INTFLAG) USB Activity Detection Interrupt Mask */
#define USBHS_INTFLAG_WAKEUP(value)           (USBHS_INTFLAG_WAKEUP_Msk & (_UINT32_(value) << USBHS_INTFLAG_WAKEUP_Pos)) /* Assigment of value for WAKEUP in the USBHS_INTFLAG register */
#define USBHS_INTFLAG_RESUME_Pos              _UINT32_(1)                                          /* (USBHS_INTFLAG) Resume Interrupt Position */
#define USBHS_INTFLAG_RESUME_Msk              (_UINT32_(0x1) << USBHS_INTFLAG_RESUME_Pos)          /* (USBHS_INTFLAG) Resume Interrupt Mask */
#define USBHS_INTFLAG_RESUME(value)           (USBHS_INTFLAG_RESUME_Msk & (_UINT32_(value) << USBHS_INTFLAG_RESUME_Pos)) /* Assigment of value for RESUME in the USBHS_INTFLAG register */
#define USBHS_INTFLAG_USB_Pos                 _UINT32_(2)                                          /* (USBHS_INTFLAG) USBCORE General Interrupt Position */
#define USBHS_INTFLAG_USB_Msk                 (_UINT32_(0x1) << USBHS_INTFLAG_USB_Pos)             /* (USBHS_INTFLAG) USBCORE General Interrupt Mask */
#define USBHS_INTFLAG_USB(value)              (USBHS_INTFLAG_USB_Msk & (_UINT32_(value) << USBHS_INTFLAG_USB_Pos)) /* Assigment of value for USB in the USBHS_INTFLAG register */
#define USBHS_INTFLAG_DMA_Pos                 _UINT32_(3)                                          /* (USBHS_INTFLAG) DMA Interrupt Position */
#define USBHS_INTFLAG_DMA_Msk                 (_UINT32_(0x1) << USBHS_INTFLAG_DMA_Pos)             /* (USBHS_INTFLAG) DMA Interrupt Mask */
#define USBHS_INTFLAG_DMA(value)              (USBHS_INTFLAG_DMA_Msk & (_UINT32_(value) << USBHS_INTFLAG_DMA_Pos)) /* Assigment of value for DMA in the USBHS_INTFLAG register */
#define USBHS_INTFLAG_T1MS_Pos                _UINT32_(4)                                          /* (USBHS_INTFLAG) Timer 1ms Tick Interrupt Position */
#define USBHS_INTFLAG_T1MS_Msk                (_UINT32_(0x1) << USBHS_INTFLAG_T1MS_Pos)            /* (USBHS_INTFLAG) Timer 1ms Tick Interrupt Mask */
#define USBHS_INTFLAG_T1MS(value)             (USBHS_INTFLAG_T1MS_Msk & (_UINT32_(value) << USBHS_INTFLAG_T1MS_Pos)) /* Assigment of value for T1MS in the USBHS_INTFLAG register */
#define USBHS_INTFLAG_PHYRDY_Pos              _UINT32_(5)                                          /* (USBHS_INTFLAG) PHY Ready Interrupt Position */
#define USBHS_INTFLAG_PHYRDY_Msk              (_UINT32_(0x1) << USBHS_INTFLAG_PHYRDY_Pos)          /* (USBHS_INTFLAG) PHY Ready Interrupt Mask */
#define USBHS_INTFLAG_PHYRDY(value)           (USBHS_INTFLAG_PHYRDY_Msk & (_UINT32_(value) << USBHS_INTFLAG_PHYRDY_Pos)) /* Assigment of value for PHYRDY in the USBHS_INTFLAG register */
#define USBHS_INTFLAG_Msk                     _UINT32_(0x0000003F)                                 /* (USBHS_INTFLAG) Register Mask  */


/* -------- USBHS_STATUS : (USBHS Offset: 0x18) ( R/ 32) USBHS Status Register -------- */
#define USBHS_STATUS_RESETVALUE               _UINT32_(0x00)                                       /*  (USBHS_STATUS) USBHS Status Register  Reset Value */

#define USBHS_STATUS_PHYRDY_Pos               _UINT32_(0)                                          /* (USBHS_STATUS) PHY Is Ready for USBCORE Activity Position */
#define USBHS_STATUS_PHYRDY_Msk               (_UINT32_(0x1) << USBHS_STATUS_PHYRDY_Pos)           /* (USBHS_STATUS) PHY Is Ready for USBCORE Activity Mask */
#define USBHS_STATUS_PHYRDY(value)            (USBHS_STATUS_PHYRDY_Msk & (_UINT32_(value) << USBHS_STATUS_PHYRDY_Pos)) /* Assigment of value for PHYRDY in the USBHS_STATUS register */
#define USBHS_STATUS_PHYON_Pos                _UINT32_(1)                                          /* (USBHS_STATUS) Power On of PHY Complete Position */
#define USBHS_STATUS_PHYON_Msk                (_UINT32_(0x1) << USBHS_STATUS_PHYON_Pos)            /* (USBHS_STATUS) Power On of PHY Complete Mask */
#define USBHS_STATUS_PHYON(value)             (USBHS_STATUS_PHYON_Msk & (_UINT32_(value) << USBHS_STATUS_PHYON_Pos)) /* Assigment of value for PHYON in the USBHS_STATUS register */
#define USBHS_STATUS_VREGRDY_Pos              _UINT32_(2)                                          /* (USBHS_STATUS) USB Voltage Regulator Status Position */
#define USBHS_STATUS_VREGRDY_Msk              (_UINT32_(0x1) << USBHS_STATUS_VREGRDY_Pos)          /* (USBHS_STATUS) USB Voltage Regulator Status Mask */
#define USBHS_STATUS_VREGRDY(value)           (USBHS_STATUS_VREGRDY_Msk & (_UINT32_(value) << USBHS_STATUS_VREGRDY_Pos)) /* Assigment of value for VREGRDY in the USBHS_STATUS register */
#define USBHS_STATUS_Msk                      _UINT32_(0x00000007)                                 /* (USBHS_STATUS) Register Mask  */


/* -------- USBHS_SYNCBUSY : (USBHS Offset: 0x1C) ( R/ 32) USBHS Syncbusy Register -------- */
#define USBHS_SYNCBUSY_RESETVALUE             _UINT32_(0x00)                                       /*  (USBHS_SYNCBUSY) USBHS Syncbusy Register  Reset Value */

#define USBHS_SYNCBUSY_SWRST_Pos              _UINT32_(0)                                          /* (USBHS_SYNCBUSY) Software reset busy bit Position */
#define USBHS_SYNCBUSY_SWRST_Msk              (_UINT32_(0x1) << USBHS_SYNCBUSY_SWRST_Pos)          /* (USBHS_SYNCBUSY) Software reset busy bit Mask */
#define USBHS_SYNCBUSY_SWRST(value)           (USBHS_SYNCBUSY_SWRST_Msk & (_UINT32_(value) << USBHS_SYNCBUSY_SWRST_Pos)) /* Assigment of value for SWRST in the USBHS_SYNCBUSY register */
#define USBHS_SYNCBUSY_ENABLE_Pos             _UINT32_(1)                                          /* (USBHS_SYNCBUSY) Enable busy bit Position */
#define USBHS_SYNCBUSY_ENABLE_Msk             (_UINT32_(0x1) << USBHS_SYNCBUSY_ENABLE_Pos)         /* (USBHS_SYNCBUSY) Enable busy bit Mask */
#define USBHS_SYNCBUSY_ENABLE(value)          (USBHS_SYNCBUSY_ENABLE_Msk & (_UINT32_(value) << USBHS_SYNCBUSY_ENABLE_Pos)) /* Assigment of value for ENABLE in the USBHS_SYNCBUSY register */
#define USBHS_SYNCBUSY_T1MSEN_Pos             _UINT32_(2)                                          /* (USBHS_SYNCBUSY) T1MS enable busy bit Position */
#define USBHS_SYNCBUSY_T1MSEN_Msk             (_UINT32_(0x1) << USBHS_SYNCBUSY_T1MSEN_Pos)         /* (USBHS_SYNCBUSY) T1MS enable busy bit Mask */
#define USBHS_SYNCBUSY_T1MSEN(value)          (USBHS_SYNCBUSY_T1MSEN_Msk & (_UINT32_(value) << USBHS_SYNCBUSY_T1MSEN_Pos)) /* Assigment of value for T1MSEN in the USBHS_SYNCBUSY register */
#define USBHS_SYNCBUSY_Msk                    _UINT32_(0x00000007)                                 /* (USBHS_SYNCBUSY) Register Mask  */


