Microchip-MPLAB-Harmony/reference_apps/apps/pic32cz_ca80_cult/pic32cz_ca80_getting_started_ext/firmware/src/packs/PIC32CZ8110CA80208_DFP/component/usbhs.h
#define USBHS_MISC_RXEDMA_Pos                 _UINT8_(0)                                           /* (USBHS_MISC) DMA_REQ signal for all OUT endpoints will be deasserted based on this bit selection Position */
#define USBHS_MISC_RXEDMA_Msk                 (_UINT8_(0x1) << USBHS_MISC_RXEDMA_Pos)              /* (USBHS_MISC) DMA_REQ signal for all OUT endpoints will be deasserted based on this bit selection Mask */
#define USBHS_MISC_RXEDMA(value)              (USBHS_MISC_RXEDMA_Msk & (_UINT8_(value) << USBHS_MISC_RXEDMA_Pos)) /* Assigment of value for RXEDMA in the USBHS_MISC register */
#define   USBHS_MISC_RXEDMA_MAXP_Val          _UINT8_(0x0)                                         /* (USBHS_MISC) Dma_req signal for all out endpoints will be de-asserted when maxp bytes have been written to an endpoint. this is late mode.  */
#define   USBHS_MISC_RXEDMA_MAXP_8_Val        _UINT8_(0x1)                                         /* (USBHS_MISC) Dma_req signal for all out endpoints will be de-asserted when maxp-8 bytes have been written to an endpoint. this is early mode.  */
#define USBHS_MISC_RXEDMA_MAXP                (USBHS_MISC_RXEDMA_MAXP_Val << USBHS_MISC_RXEDMA_Pos) /* (USBHS_MISC) Dma_req signal for all out endpoints will be de-asserted when maxp bytes have been written to an endpoint. this is late mode. Position  */
#define USBHS_MISC_RXEDMA_MAXP_8              (USBHS_MISC_RXEDMA_MAXP_8_Val << USBHS_MISC_RXEDMA_Pos) /* (USBHS_MISC) Dma_req signal for all out endpoints will be de-asserted when maxp-8 bytes have been written to an endpoint. this is early mode. Position  */
#define USBHS_MISC_TXEDMA_Pos                 _UINT8_(1)                                           /* (USBHS_MISC) DMA_REQ signal for all IN endpoints will be deasserted based on this bit selection Position */
#define USBHS_MISC_TXEDMA_Msk                 (_UINT8_(0x1) << USBHS_MISC_TXEDMA_Pos)              /* (USBHS_MISC) DMA_REQ signal for all IN endpoints will be deasserted based on this bit selection Mask */
#define USBHS_MISC_TXEDMA(value)              (USBHS_MISC_TXEDMA_Msk & (_UINT8_(value) << USBHS_MISC_TXEDMA_Pos)) /* Assigment of value for TXEDMA in the USBHS_MISC register */
#define   USBHS_MISC_TXEDMA_MAXP_Val          _UINT8_(0x0)                                         /* (USBHS_MISC) Dma_req signal for all in endpoints will be de-asserted when maxp bytes have been written to an endpoint. this is late mode.  */
#define   USBHS_MISC_TXEDMA_MAXP_8_Val        _UINT8_(0x1)                                         /* (USBHS_MISC) Dma_req signal for all in endpoints will be de-asserted when maxp-8 bytes have been written to an endpoint. this is early mode.  */
#define USBHS_MISC_TXEDMA_MAXP                (USBHS_MISC_TXEDMA_MAXP_Val << USBHS_MISC_TXEDMA_Pos) /* (USBHS_MISC) Dma_req signal for all in endpoints will be de-asserted when maxp bytes have been written to an endpoint. this is late mode. Position  */
#define USBHS_MISC_TXEDMA_MAXP_8              (USBHS_MISC_TXEDMA_MAXP_8_Val << USBHS_MISC_TXEDMA_Pos) /* (USBHS_MISC) Dma_req signal for all in endpoints will be de-asserted when maxp-8 bytes have been written to an endpoint. this is early mode. Position  */
#define USBHS_MISC_Msk                        _UINT8_(0x03)                                        /* (USBHS_MISC) Register Mask  */


/* -------- USBHS_TXFIFOSZ : (USBHS Offset: 0x1062) (R/W 8) Controls The Size Of The Selected TX Endpoint FIFO -------- */
#define USBHS_TXFIFOSZ_RESETVALUE             _UINT8_(0x00)                                        /*  (USBHS_TXFIFOSZ) Controls The Size Of The Selected TX Endpoint FIFO  Reset Value */

#define USBHS_TXFIFOSZ_SZ_Pos                 _UINT8_(0)                                           /* (USBHS_TXFIFOSZ) maximum packet size to be allowed Position */
#define USBHS_TXFIFOSZ_SZ_Msk                 (_UINT8_(0xF) << USBHS_TXFIFOSZ_SZ_Pos)              /* (USBHS_TXFIFOSZ) maximum packet size to be allowed Mask */
#define USBHS_TXFIFOSZ_SZ(value)              (USBHS_TXFIFOSZ_SZ_Msk & (_UINT8_(value) << USBHS_TXFIFOSZ_SZ_Pos)) /* Assigment of value for SZ in the USBHS_TXFIFOSZ register */
#define   USBHS_TXFIFOSZ_SZ_8BYTES_Val        _UINT8_(0x0)                                         /* (USBHS_TXFIFOSZ) 8 BYTES  */
#define   USBHS_TXFIFOSZ_SZ_16BYTES_Val       _UINT8_(0x1)                                         /* (USBHS_TXFIFOSZ) 16 BYTES  */
#define   USBHS_TXFIFOSZ_SZ_32BYTES_Val       _UINT8_(0x2)                                         /* (USBHS_TXFIFOSZ) 32 BYTES  */
#define   USBHS_TXFIFOSZ_SZ_64BYTES_Val       _UINT8_(0x3)                                         /* (USBHS_TXFIFOSZ) 64 BYTES  */
#define   USBHS_TXFIFOSZ_SZ_128BYTES_Val      _UINT8_(0x4)                                         /* (USBHS_TXFIFOSZ) 128 BYTES  */
#define   USBHS_TXFIFOSZ_SZ_256BYTES_Val      _UINT8_(0x5)                                         /* (USBHS_TXFIFOSZ) 256 BYTES  */
#define   USBHS_TXFIFOSZ_SZ_512BYTES_Val      _UINT8_(0x6)                                         /* (USBHS_TXFIFOSZ) 512 BYTES  */
#define   USBHS_TXFIFOSZ_SZ_1024BYTES_Val     _UINT8_(0x7)                                         /* (USBHS_TXFIFOSZ) 1024 BYTES  */
#define   USBHS_TXFIFOSZ_SZ_2048BYTES_Val     _UINT8_(0x8)                                         /* (USBHS_TXFIFOSZ) 2048 BYTES  */
#define   USBHS_TXFIFOSZ_SZ_4096BYTES_Val     _UINT8_(0x9)                                         /* (USBHS_TXFIFOSZ) 4096 BYTES  */
#define USBHS_TXFIFOSZ_SZ_8BYTES              (USBHS_TXFIFOSZ_SZ_8BYTES_Val << USBHS_TXFIFOSZ_SZ_Pos) /* (USBHS_TXFIFOSZ) 8 BYTES Position  */
#define USBHS_TXFIFOSZ_SZ_16BYTES             (USBHS_TXFIFOSZ_SZ_16BYTES_Val << USBHS_TXFIFOSZ_SZ_Pos) /* (USBHS_TXFIFOSZ) 16 BYTES Position  */
#define USBHS_TXFIFOSZ_SZ_32BYTES             (USBHS_TXFIFOSZ_SZ_32BYTES_Val << USBHS_TXFIFOSZ_SZ_Pos) /* (USBHS_TXFIFOSZ) 32 BYTES Position  */
#define USBHS_TXFIFOSZ_SZ_64BYTES             (USBHS_TXFIFOSZ_SZ_64BYTES_Val << USBHS_TXFIFOSZ_SZ_Pos) /* (USBHS_TXFIFOSZ) 64 BYTES Position  */
#define USBHS_TXFIFOSZ_SZ_128BYTES            (USBHS_TXFIFOSZ_SZ_128BYTES_Val << USBHS_TXFIFOSZ_SZ_Pos) /* (USBHS_TXFIFOSZ) 128 BYTES Position  */
#define USBHS_TXFIFOSZ_SZ_256BYTES            (USBHS_TXFIFOSZ_SZ_256BYTES_Val << USBHS_TXFIFOSZ_SZ_Pos) /* (USBHS_TXFIFOSZ) 256 BYTES Position  */
#define USBHS_TXFIFOSZ_SZ_512BYTES            (USBHS_TXFIFOSZ_SZ_512BYTES_Val << USBHS_TXFIFOSZ_SZ_Pos) /* (USBHS_TXFIFOSZ) 512 BYTES Position  */
#define USBHS_TXFIFOSZ_SZ_1024BYTES           (USBHS_TXFIFOSZ_SZ_1024BYTES_Val << USBHS_TXFIFOSZ_SZ_Pos) /* (USBHS_TXFIFOSZ) 1024 BYTES Position  */
#define USBHS_TXFIFOSZ_SZ_2048BYTES           (USBHS_TXFIFOSZ_SZ_2048BYTES_Val << USBHS_TXFIFOSZ_SZ_Pos) /* (USBHS_TXFIFOSZ) 2048 BYTES Position  */
#define USBHS_TXFIFOSZ_SZ_4096BYTES           (USBHS_TXFIFOSZ_SZ_4096BYTES_Val << USBHS_TXFIFOSZ_SZ_Pos) /* (USBHS_TXFIFOSZ) 4096 BYTES Position  */
#define USBHS_TXFIFOSZ_DPB_Pos                _UINT8_(4)                                           /* (USBHS_TXFIFOSZ) double packet buffering supported or not Position */
#define USBHS_TXFIFOSZ_DPB_Msk                (_UINT8_(0x1) << USBHS_TXFIFOSZ_DPB_Pos)             /* (USBHS_TXFIFOSZ) double packet buffering supported or not Mask */
#define USBHS_TXFIFOSZ_DPB(value)             (USBHS_TXFIFOSZ_DPB_Msk & (_UINT8_(value) << USBHS_TXFIFOSZ_DPB_Pos)) /* Assigment of value for DPB in the USBHS_TXFIFOSZ register */
#define USBHS_TXFIFOSZ_Msk                    _UINT8_(0x1F)                                        /* (USBHS_TXFIFOSZ) Register Mask  */


