Microchip-MPLAB-Harmony/reference_apps/apps/pic32cz_ca80_cult/pic32cz_ca80_getting_started_ext/firmware/src/packs/PIC32CZ8110CA80208_DFP/component/usbhs.h
/* -------- USBHS_LPMINTREN : (USBHS Offset: 0x1363) (R/W 8) LPM Interrupts Enable Register -------- */
#define USBHS_LPMINTREN_RESETVALUE            _UINT8_(0x00)                                        /*  (USBHS_LPMINTREN) LPM Interrupts Enable Register  Reset Value */

#define USBHS_LPMINTREN_LPMSTEN_Pos           _UINT8_(0)                                           /* (USBHS_LPMINTREN) LPMMST interrupt Position */
#define USBHS_LPMINTREN_LPMSTEN_Msk           (_UINT8_(0x1) << USBHS_LPMINTREN_LPMSTEN_Pos)        /* (USBHS_LPMINTREN) LPMMST interrupt Mask */
#define USBHS_LPMINTREN_LPMSTEN(value)        (USBHS_LPMINTREN_LPMSTEN_Msk & (_UINT8_(value) << USBHS_LPMINTREN_LPMSTEN_Pos)) /* Assigment of value for LPMSTEN in the USBHS_LPMINTREN register */
#define USBHS_LPMINTREN_LPMNYEN_Pos           _UINT8_(1)                                           /* (USBHS_LPMINTREN) LPMMNY interrupt Position */
#define USBHS_LPMINTREN_LPMNYEN_Msk           (_UINT8_(0x1) << USBHS_LPMINTREN_LPMNYEN_Pos)        /* (USBHS_LPMINTREN) LPMMNY interrupt Mask */
#define USBHS_LPMINTREN_LPMNYEN(value)        (USBHS_LPMINTREN_LPMNYEN_Msk & (_UINT8_(value) << USBHS_LPMINTREN_LPMNYEN_Pos)) /* Assigment of value for LPMNYEN in the USBHS_LPMINTREN register */
#define USBHS_LPMINTREN_LPMACKEN_Pos          _UINT8_(2)                                           /* (USBHS_LPMINTREN) LPMACK interrupt Position */
#define USBHS_LPMINTREN_LPMACKEN_Msk          (_UINT8_(0x1) << USBHS_LPMINTREN_LPMACKEN_Pos)       /* (USBHS_LPMINTREN) LPMACK interrupt Mask */
#define USBHS_LPMINTREN_LPMACKEN(value)       (USBHS_LPMINTREN_LPMACKEN_Msk & (_UINT8_(value) << USBHS_LPMINTREN_LPMACKEN_Pos)) /* Assigment of value for LPMACKEN in the USBHS_LPMINTREN register */
#define USBHS_LPMINTREN_LPMNCEN_Pos           _UINT8_(3)                                           /* (USBHS_LPMINTREN) LPMNC interrupt Position */
#define USBHS_LPMINTREN_LPMNCEN_Msk           (_UINT8_(0x1) << USBHS_LPMINTREN_LPMNCEN_Pos)        /* (USBHS_LPMINTREN) LPMNC interrupt Mask */
#define USBHS_LPMINTREN_LPMNCEN(value)        (USBHS_LPMINTREN_LPMNCEN_Msk & (_UINT8_(value) << USBHS_LPMINTREN_LPMNCEN_Pos)) /* Assigment of value for LPMNCEN in the USBHS_LPMINTREN register */
#define USBHS_LPMINTREN_LPMRESEN_Pos          _UINT8_(4)                                           /* (USBHS_LPMINTREN) LPMRES interrupt Position */
#define USBHS_LPMINTREN_LPMRESEN_Msk          (_UINT8_(0x1) << USBHS_LPMINTREN_LPMRESEN_Pos)       /* (USBHS_LPMINTREN) LPMRES interrupt Mask */
#define USBHS_LPMINTREN_LPMRESEN(value)       (USBHS_LPMINTREN_LPMRESEN_Msk & (_UINT8_(value) << USBHS_LPMINTREN_LPMRESEN_Pos)) /* Assigment of value for LPMRESEN in the USBHS_LPMINTREN register */
#define USBHS_LPMINTREN_LPMERREN_Pos          _UINT8_(5)                                           /* (USBHS_LPMINTREN) LPMERR interrupt Position */
#define USBHS_LPMINTREN_LPMERREN_Msk          (_UINT8_(0x1) << USBHS_LPMINTREN_LPMERREN_Pos)       /* (USBHS_LPMINTREN) LPMERR interrupt Mask */
#define USBHS_LPMINTREN_LPMERREN(value)       (USBHS_LPMINTREN_LPMERREN_Msk & (_UINT8_(value) << USBHS_LPMINTREN_LPMERREN_Pos)) /* Assigment of value for LPMERREN in the USBHS_LPMINTREN register */
#define USBHS_LPMINTREN_Msk                   _UINT8_(0x3F)                                        /* (USBHS_LPMINTREN) Register Mask  */


/* -------- USBHS_LPMINTR : (USBHS Offset: 0x1364) (R/W 8) Status Of The LPM Power State -------- */
#define USBHS_LPMINTR_RESETVALUE              _UINT8_(0x00)                                        /*  (USBHS_LPMINTR) Status Of The LPM Power State  Reset Value */

#define USBHS_LPMINTR_Msk                     _UINT8_(0x00)                                        /* (USBHS_LPMINTR) Register Mask  */

/* HOST mode */
#define USBHS_LPMINTR_HOST_LPMST_Pos          _UINT8_(0)                                           /* (USBHS_LPMINTR) this bit is set when an lpm transaction is transmitted and the device responds with a stall. Position */
#define USBHS_LPMINTR_HOST_LPMST_Msk          (_UINT8_(0x1) << USBHS_LPMINTR_HOST_LPMST_Pos)       /* (USBHS_LPMINTR) this bit is set when an lpm transaction is transmitted and the device responds with a stall. Mask */
#define USBHS_LPMINTR_HOST_LPMST(value)       (USBHS_LPMINTR_HOST_LPMST_Msk & (_UINT8_(value) << USBHS_LPMINTR_HOST_LPMST_Pos))
#define USBHS_LPMINTR_HOST_LPMNY_Pos          _UINT8_(1)                                           /* (USBHS_LPMINTR) this bit is set when an lpm transaction is transmitted and the device responds with a nyet. Position */
#define USBHS_LPMINTR_HOST_LPMNY_Msk          (_UINT8_(0x1) << USBHS_LPMINTR_HOST_LPMNY_Pos)       /* (USBHS_LPMINTR) this bit is set when an lpm transaction is transmitted and the device responds with a nyet. Mask */
#define USBHS_LPMINTR_HOST_LPMNY(value)       (USBHS_LPMINTR_HOST_LPMNY_Msk & (_UINT8_(value) << USBHS_LPMINTR_HOST_LPMNY_Pos))
#define USBHS_LPMINTR_HOST_LPMACK_Pos         _UINT8_(2)                                           /* (USBHS_LPMINTR) this bit is set when an lpm transaction is transmitted and the device responds with an ack. Position */
#define USBHS_LPMINTR_HOST_LPMACK_Msk         (_UINT8_(0x1) << USBHS_LPMINTR_HOST_LPMACK_Pos)      /* (USBHS_LPMINTR) this bit is set when an lpm transaction is transmitted and the device responds with an ack. Mask */
#define USBHS_LPMINTR_HOST_LPMACK(value)      (USBHS_LPMINTR_HOST_LPMACK_Msk & (_UINT8_(value) << USBHS_LPMINTR_HOST_LPMACK_Pos))
#define USBHS_LPMINTR_HOST_LPMNC_Pos          _UINT8_(3)                                           /* (USBHS_LPMINTR) this bit is set when an lpm transaction has been transmitted and has failed to complete. Position */
#define USBHS_LPMINTR_HOST_LPMNC_Msk          (_UINT8_(0x1) << USBHS_LPMINTR_HOST_LPMNC_Pos)       /* (USBHS_LPMINTR) this bit is set when an lpm transaction has been transmitted and has failed to complete. Mask */
#define USBHS_LPMINTR_HOST_LPMNC(value)       (USBHS_LPMINTR_HOST_LPMNC_Msk & (_UINT8_(value) << USBHS_LPMINTR_HOST_LPMNC_Pos))
#define USBHS_LPMINTR_HOST_LPMRES_Pos         _UINT8_(4)                                           /* (USBHS_LPMINTR) this bit is set when the core has been resumed for any reason. Position */
#define USBHS_LPMINTR_HOST_LPMRES_Msk         (_UINT8_(0x1) << USBHS_LPMINTR_HOST_LPMRES_Pos)      /* (USBHS_LPMINTR) this bit is set when the core has been resumed for any reason. Mask */
#define USBHS_LPMINTR_HOST_LPMRES(value)      (USBHS_LPMINTR_HOST_LPMRES_Msk & (_UINT8_(value) << USBHS_LPMINTR_HOST_LPMRES_Pos))
#define USBHS_LPMINTR_HOST_LPMERR_Pos         _UINT8_(5)                                           /* (USBHS_LPMINTR) this bit is set if a response to the lpm transaction is received with a bit stuff error or a pid error Position */
#define USBHS_LPMINTR_HOST_LPMERR_Msk         (_UINT8_(0x1) << USBHS_LPMINTR_HOST_LPMERR_Pos)      /* (USBHS_LPMINTR) this bit is set if a response to the lpm transaction is received with a bit stuff error or a pid error Mask */
#define USBHS_LPMINTR_HOST_LPMERR(value)      (USBHS_LPMINTR_HOST_LPMERR_Msk & (_UINT8_(value) << USBHS_LPMINTR_HOST_LPMERR_Pos))
#define USBHS_LPMINTR_HOST_Msk                _UINT8_(0x3F)                                         /* (USBHS_LPMINTR_HOST) Register Mask  */

/* PERIPHERAL mode */
#define USBHS_LPMINTR_PERIPHERAL_LPMST_Pos    _UINT8_(0)                                           /* (USBHS_LPMINTR) this bit is set when an lpm transaction is received and the core responds with a stall. Position */
#define USBHS_LPMINTR_PERIPHERAL_LPMST_Msk    (_UINT8_(0x1) << USBHS_LPMINTR_PERIPHERAL_LPMST_Pos) /* (USBHS_LPMINTR) this bit is set when an lpm transaction is received and the core responds with a stall. Mask */
#define USBHS_LPMINTR_PERIPHERAL_LPMST(value) (USBHS_LPMINTR_PERIPHERAL_LPMST_Msk & (_UINT8_(value) << USBHS_LPMINTR_PERIPHERAL_LPMST_Pos))
#define USBHS_LPMINTR_PERIPHERAL_LPMNY_Pos    _UINT8_(1)                                           /* (USBHS_LPMINTR) this bit is set when an lpm transaction is received and the core responds with a nyet Position */
#define USBHS_LPMINTR_PERIPHERAL_LPMNY_Msk    (_UINT8_(0x1) << USBHS_LPMINTR_PERIPHERAL_LPMNY_Pos) /* (USBHS_LPMINTR) this bit is set when an lpm transaction is received and the core responds with a nyet Mask */
#define USBHS_LPMINTR_PERIPHERAL_LPMNY(value) (USBHS_LPMINTR_PERIPHERAL_LPMNY_Msk & (_UINT8_(value) << USBHS_LPMINTR_PERIPHERAL_LPMNY_Pos))
#define USBHS_LPMINTR_PERIPHERAL_LPMACK_Pos   _UINT8_(2)                                           /* (USBHS_LPMINTR) this bit is set when an lpm transaction is received and the core responds with an ack. Position */
#define USBHS_LPMINTR_PERIPHERAL_LPMACK_Msk   (_UINT8_(0x1) << USBHS_LPMINTR_PERIPHERAL_LPMACK_Pos) /* (USBHS_LPMINTR) this bit is set when an lpm transaction is received and the core responds with an ack. Mask */
#define USBHS_LPMINTR_PERIPHERAL_LPMACK(value) (USBHS_LPMINTR_PERIPHERAL_LPMACK_Msk & (_UINT8_(value) << USBHS_LPMINTR_PERIPHERAL_LPMACK_Pos))
#define USBHS_LPMINTR_PERIPHERAL_LPMNC_Pos    _UINT8_(3)                                           /* (USBHS_LPMINTR) this bit is set when an lpm transaction is received and the core responds with a nyet due to data pending in the rx fifos. Position */
#define USBHS_LPMINTR_PERIPHERAL_LPMNC_Msk    (_UINT8_(0x1) << USBHS_LPMINTR_PERIPHERAL_LPMNC_Pos) /* (USBHS_LPMINTR) this bit is set when an lpm transaction is received and the core responds with a nyet due to data pending in the rx fifos. Mask */
#define USBHS_LPMINTR_PERIPHERAL_LPMNC(value) (USBHS_LPMINTR_PERIPHERAL_LPMNC_Msk & (_UINT8_(value) << USBHS_LPMINTR_PERIPHERAL_LPMNC_Pos))
#define USBHS_LPMINTR_PERIPHERAL_LPMRES_Pos   _UINT8_(4)                                           /* (USBHS_LPMINTR) this bit is set if the core has been resumed for any reason. Position */
#define USBHS_LPMINTR_PERIPHERAL_LPMRES_Msk   (_UINT8_(0x1) << USBHS_LPMINTR_PERIPHERAL_LPMRES_Pos) /* (USBHS_LPMINTR) this bit is set if the core has been resumed for any reason. Mask */
#define USBHS_LPMINTR_PERIPHERAL_LPMRES(value) (USBHS_LPMINTR_PERIPHERAL_LPMRES_Msk & (_UINT8_(value) << USBHS_LPMINTR_PERIPHERAL_LPMRES_Pos))
#define USBHS_LPMINTR_PERIPHERAL_LPMERR_Pos   _UINT8_(5)                                           /* (USBHS_LPMINTR) this bit is set if an lpm transaction is received that has a linkstate field that is not supported Position */
#define USBHS_LPMINTR_PERIPHERAL_LPMERR_Msk   (_UINT8_(0x1) << USBHS_LPMINTR_PERIPHERAL_LPMERR_Pos) /* (USBHS_LPMINTR) this bit is set if an lpm transaction is received that has a linkstate field that is not supported Mask */
#define USBHS_LPMINTR_PERIPHERAL_LPMERR(value) (USBHS_LPMINTR_PERIPHERAL_LPMERR_Msk & (_UINT8_(value) << USBHS_LPMINTR_PERIPHERAL_LPMERR_Pos))
#define USBHS_LPMINTR_PERIPHERAL_Msk          _UINT8_(0x3F)                                         /* (USBHS_LPMINTR_PERIPHERAL) Register Mask  */


