Microchip-MPLAB-Harmony/reference_apps/apps/pic32cz_ca80_cult/pic32cz_ca80_getting_started_ext/firmware/src/packs/PIC32CZ8110CA80208_DFP/component/usbhs.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief DMACNT register API structure */
typedef struct
{
  __IO  uint32_t                       USBHS_DMACNTL;      /**< Offset: 0x00 (R/W  32) DMA Transfer Control For Each Channel */
  __IO  uint32_t                       USBHS_DMAADDR;      /**< Offset: 0x04 (R/W  32) Memory Address Of The Corresponding DMA Channel */
  __IO  uint32_t                       USBHS_DMACOUNT;     /**< Offset: 0x08 (R/W  32) Current DMA Count Of The Transfer */
  __I   uint8_t                        Reserved1[0x04];
} usbhs_dmacnt_registers_t;

/** \brief TXFUNADDR register API structure */
typedef struct
{
  __IO  uint8_t                        USBHS_TXFUNCADDREP; /**< Offset: 0x00 (R/W  8) Relevant In Host Mode Only. Address Of The Target Function. */
  __I   uint8_t                        Reserved1[0x01];
  __IO  uint8_t                        USBHS_TXHUBADDREP;  /**< Offset: 0x02 (R/W  8) Relevant In Host Mode Only. HUB Address */
  __IO  uint8_t                        USBHS_TXHUBPORT;    /**< Offset: 0x03 (R/W  8) Relevant In Host Mode Only. HUB Address */
  __IO  uint8_t                        USBHS_RXFUNCADDREP; /**< Offset: 0x04 (R/W  8) Relevant In Host Mode Only. Address Of The Target Function. */
  __I   uint8_t                        Reserved2[0x01];
  __IO  uint8_t                        USBHS_RXHUBADDREP;  /**< Offset: 0x06 (R/W  8) Relevant In Host Mode Only. HUB Address */
  __IO  uint8_t                        USBHS_RXHUBPORT;    /**< Offset: 0x07 (R/W  8) Relevant In Host Mode Only. HUB Address */
} usbhs_txfunaddr_registers_t;

#define USBHS_TXFUNADDR_NUMBER 8

#define USBHS_DMACNT_NUMBER 8

/** \brief USBHS register API structure */
typedef struct
{  /* USB High Speed */
  __IO  uint32_t                       USBHS_CTRLA;        /**< Offset: 0x00 (R/W  32) USBHS Control Register A. (All bits except ENABLE and SWRST are Enable protected) */
  __IO  uint32_t                       USBHS_CTRLB;        /**< Offset: 0x04 (R/W  32) USBHS Control Register B */
  __IO  uint32_t                       USBHS_CTRLC;        /**< Offset: 0x08 (R/W  32) USBHS Control Register C */
  __IO  uint32_t                       USBHS_INTENCLR;     /**< Offset: 0x0C (R/W  32) USBHS Interrupt Enable Clear Register */
  __IO  uint32_t                       USBHS_INTENSET;     /**< Offset: 0x10 (R/W  32) USBHS Interrupt Enable Clear Register */
  __IO  uint32_t                       USBHS_INTFLAG;      /**< Offset: 0x14 (R/W  32) USBHS Interrupt Flag Register */
  __I   uint32_t                       USBHS_STATUS;       /**< Offset: 0x18 (R/   32) USBHS Status Register */
  __I   uint32_t                       USBHS_SYNCBUSY;     /**< Offset: 0x1C (R/   32) USBHS Syncbusy Register */
  __I   uint8_t                        Reserved1[0xFE0];
  __IO  uint8_t                        USBHS_FADDR;        /**< Offset: 0x1000 (R/W  8) Function Address Register */
  __IO  uint8_t                        USBHS_POWER;        /**< Offset: 0x1001 (R/W  8) Used For Controlling Suspend And Resume Signaling And Some Basic Operation Of USBCORE */
  __I   uint16_t                       USBHS_INTRTX;       /**< Offset: 0x1002 (R/   16) Read Only Register Which Indicates Which Interrupts Are Currently Active For EP0 And TX EP1-15 */
  __I   uint16_t                       USBHS_INTRRX;       /**< Offset: 0x1004 (R/   16) Read Only Register Which Indicates Which Interrupts Are Currently Active For RX EP1-15 */
  __IO  uint16_t                       USBHS_INTRTXE;      /**< Offset: 0x1006 (R/W  16) Interrupt Enable Bits for INTRTX */
  __IO  uint16_t                       USBHS_INTRRXE;      /**< Offset: 0x1008 (R/W  16) Interrupt Enable Bits for INTRRX */
  __I   uint8_t                        USBHS_INTRUSB;      /**< Offset: 0x100A (R/   8) Read Only Register Which Indicates Which USB Interrupts Are Currently Active. */
  __IO  uint8_t                        USBHS_INTRUSBE;     /**< Offset: 0x100B (R/W  8) Interrupt Enable Bits for USB Interrupts */
  __I   uint16_t                       USBHS_FRAME;        /**< Offset: 0x100C (R/   16) Holds The Last Received Frame Number */
  __IO  uint8_t                        USBHS_INDEX;        /**< Offset: 0x100E (R/W  8) Index Is A 4-Bit Register That Determines Which Endpoint Control/Status Registers Are Accessed */
  __IO  uint8_t                        USBHS_TESTMODE;     /**< Offset: 0x100F (R/W  8) Not Used In Normal Operation. Configuration To Put the USBCORE Into One Of The Four Test Modes For HighSpeed Operation */
  __IO  uint16_t                       USBHS_TXMAXP;       /**< Offset: 0x1010 (R/W  16) ENDPOINTX Maximum Amount Of Data That Can Be Transferred Through The Selected TX Endpoint In A Single Operation */
  __IO  uint8_t                        USBHS_TXCSRL;       /**< Offset: 0x1012 (R/W  8) ENDPOINTX Control And Status Bits for TX Endpoints 1-15 */
  __IO  uint8_t                        USBHS_TXCSRH;       /**< Offset: 0x1013 (R/W  8) ENDPOINTX Additional Control And Status Bits For TX Endpoints 1-15 */
  __IO  uint16_t                       USBHS_RXMAXP;       /**< Offset: 0x1014 (R/W  16) ENDPOINTX Maximum Amount Of Data That Can Be Transferred Through The Selected RX Endpoint In A Single Operation */
  __IO  uint8_t                        USBHS_RXCSRL;       /**< Offset: 0x1016 (R/W  8) ENDPOINTX Control And Status Bits for RX Endpoint 0 Or Endpoint 1-15 */
  __IO  uint8_t                        USBHS_RXCSRH;       /**< Offset: 0x1017 (R/W  8) ENDPOINTX Additional Control And Status Bits for RX Endpoint 0 Or Endpoint 1-15 */
  __I   uint16_t                       USBHS_RXCOUNT;      /**< Offset: 0x1018 (R/   16) ENDPOINTX Number Of Data Bytes In The Packet Currently In Line To Be Read From The RX FIFO. */
  __IO  uint8_t                        USBHS_TXTYPE;       /**< Offset: 0x101A (R/W  8) ENDPOINTX Host Mode Only: Should Be Written With The Endpoint Number To Be Targeted By The Endpoint */
  __IO  uint8_t                        USBHS_TXINTERVAL;   /**< Offset: 0x101B (R/W  8) ENDPOINTX Host Mode Only: Defines The Polling Interval For The Currently Selected TX Endpoint. */
  __IO  uint8_t                        USBHS_RXTYPE;       /**< Offset: 0x101C (R/W  8) ENDPOINTX Host Mode Only: Should Be Written With The Endpoint Number To Be Targeted By The Endpoint */
  __IO  uint8_t                        USBHS_RXINTERVAL;   /**< Offset: 0x101D (R/W  8) ENDPOINTX Host Mode Only: Defines The Polling Interval For The Currently Selected RX Endpoint. */
  __I   uint8_t                        Reserved2[0x01];
  __I   uint8_t                        USBHS_FIFOSIZE;     /**< Offset: 0x101F (R/   8) ENDPOINTX Read Only Register That Returns The Sizes Of The FIFO's Associated With The Selected Additional TX/RX Endpoints. INDEX Regsiter should be set 1-15 */
  __IO  uint32_t                       USBHS_FIFOX[8];     /**< Offset: 0x1020 (R/W  32) Address Range Provides 16 Addresses For CPU Access To The FIFO's For Each Endpoint */
  __I   uint8_t                        Reserved3[0x20];
  __IO  uint8_t                        USBHS_DEVCTL;       /**< Offset: 0x1060 (R/W  8) Selects Whether The Core Is Operating In Peripheral Or Host Mode */
  __IO  uint8_t                        USBHS_MISC;         /**< Offset: 0x1061 (R/W  8) RX/TX Early DMA Enable Bits */
  __IO  uint8_t                        USBHS_TXFIFOSZ;     /**< Offset: 0x1062 (R/W  8) Controls The Size Of The Selected TX Endpoint FIFO */
  __IO  uint8_t                        USBHS_RXFIFOSZ;     /**< Offset: 0x1063 (R/W  8) Controls The Size Of The Selected RX Endpoint FIFO */
  __IO  uint16_t                       USBHS_TXFIFOADD;    /**< Offset: 0x1064 (R/W  16) Controls The Start Address Of the Selected TX Endpoint FIFO */
  __IO  uint16_t                       USBHS_RXFIFOADD;    /**< Offset: 0x1066 (R/W  16) Controls The Start Address Of the Selected RX Endpoint FIFO */
  __I   uint8_t                        Reserved4[0x10];
  __I   uint8_t                        USBHS_EPINFO;       /**< Offset: 0x1078 (R/   8) Allows Read-Back Of The Number Of TX And RX Endpoints */
  __I   uint8_t                        USBHS_RAMINFO;      /**< Offset: 0x1079 (R/   8) Details About Width Of RAM and DMA Channels */
  __IO  uint8_t                        USBHS_LINKINFO;     /**< Offset: 0x107A (R/W  8) Allows Some Delays To Be Specified */
  __IO  uint8_t                        USBHS_VPLEN;        /**< Offset: 0x107B (R/W  8) Sets The Duration Of The VBus Pulsing Charge */
  __IO  uint8_t                        USBHS_HSEOF1;       /**< Offset: 0x107C (R/W  8) Sets The Minimum Time Gap That Is To Be Allowed Between The Start Of The Last Transaction And The EOF For HS Transactions */
  __IO  uint8_t                        USBHS_FSEOF1;       /**< Offset: 0x107D (R/W  8) Sets The Minimum Time Gap That Is To Be Allowed Between The Start Of The Last Transaction And The EOF For FS Transactions */
  __IO  uint8_t                        USBHS_LSEOF1;       /**< Offset: 0x107E (R/W  8) Sets The Minimum Time Gap That Is To Be Allowed Between The Start Of The Last Transaction And The EOF For LS Transactions */
  __IO  uint8_t                        USBHS_SOFTRST;      /**< Offset: 0x107F (R/W  8) Assert Low The Output Reset Signals NRSTO and NRSTXO */
        usbhs_txfunaddr_registers_t    TXFUNADDR[USBHS_TXFUNADDR_NUMBER]; /**< Offset: 0x1080  */
  __I   uint8_t                        Reserved5[0x140];
  __IO  uint32_t                       USBHS_DMAINTR;      /**< Offset: 0x1200 (R/W  32) DMA Interrupt Status for Each Channel */
        usbhs_dmacnt_registers_t       DMACNT[USBHS_DMACNT_NUMBER]; /**< Offset: 0x1204  */
  __I   uint8_t                        Reserved6[0x80];
  __IO  uint32_t                       USBHS_RQPKTCOUNT[7]; /**< Offset: 0x1304 (R/W  32) Host Mode Only: Used To Specify Number Of Packets That Are To Be Transaferred In A Block Transfer */
  __I   uint8_t                        Reserved7[0x20];
  __IO  uint16_t                       USBHS_RXDPKTBUFDIS; /**< Offset: 0x1340 (R/W  16) Indicates Which Of The RX Endpoints Have Disabled Double Packet Buffer Functionality */
  __IO  uint16_t                       USBHS_TXDPKTBUFDIS; /**< Offset: 0x1342 (R/W  16) Indicates Which Of The TX Endpoints Have Disabled Double Packet Buffer Functionality */
  __IO  uint16_t                       USBHS_CTUCH;        /**< Offset: 0x1344 (R/W  16) Chirp Timeout. Number Of XCLK Cycles Before The Timeout */
  __IO  uint16_t                       USBHS_CTHHSRTN;     /**< Offset: 0x1346 (R/W  16) Sets The Delay From The End Of High-Speed Resume Signaling (Acting As A Host) To Enable The UTM Normal Operating Mode */
  __IO  uint16_t                       USBHS_CTHSBT;       /**< Offset: 0x1348 (R/W  16) This Register Represents The Value To Be Added To The Minimum High Speed Timeout Period Of 736 Bit Times. */
  __I   uint8_t                        Reserved8[0x16];
  __IO  uint16_t                       USBHS_LPMATTR;      /**< Offset: 0x1360 (R/W  16) Defines The Attributes Of An LPM Transaction And Sleep Cycle. */
  __IO  uint8_t                        USBHS_LPMCNTRL;     /**< Offset: 0x1362 (R/W  8) LPM Control Register */
  __IO  uint8_t                        USBHS_LPMINTREN;    /**< Offset: 0x1363 (R/W  8) LPM Interrupts Enable Register */
  __IO  uint8_t                        USBHS_LPMINTR;      /**< Offset: 0x1364 (R/W  8) Status Of The LPM Power State */
  __IO  uint8_t                        USBHS_LPMFADDR;     /**< Offset: 0x1365 (R/W  8) Function Address In LPM Payload */
  __I   uint8_t                        Reserved9[0x19A];
  __IO  uint32_t                       USBHS_PHY00;        /**< Offset: 0x1500 (R/W  32) USBHPHY Control Register. */
  __IO  uint32_t                       USBHS_PHY04;        /**< Offset: 0x1504 (R/W  32) USBHPHY Control Register. */
  __IO  uint32_t                       USBHS_PHY08;        /**< Offset: 0x1508 (R/W  32) USBHPHY Control Register. */
  __IO  uint32_t                       USBHS_PHY0C;        /**< Offset: 0x150C (R/W  32) USBHPHY Control Register. */
  __IO  uint32_t                       USBHS_PHY10;        /**< Offset: 0x1510 (R/W  32) USBHPHY Control Register. */
  __IO  uint32_t                       USBHS_PHY14;        /**< Offset: 0x1514 (R/W  32) USBHPHY Control Register. */
  __IO  uint32_t                       USBHS_PHY18;        /**< Offset: 0x1518 (R/W  32) USBHPHY Control Register. */
  __IO  uint32_t                       USBHS_PHY1C;        /**< Offset: 0x151C (R/W  32) USBHPHY Control Register. */
  __IO  uint32_t                       USBHS_PHY20;        /**< Offset: 0x1520 (R/W  32) USBHPHY Control Register. */
  __IO  uint32_t                       USBHS_PHY24;        /**< Offset: 0x1524 (R/W  32) USBHPHY Control Register. */
  __IO  uint32_t                       USBHS_PHY28;        /**< Offset: 0x1528 (R/W  32) USBHPHY Control Register. */
  __I   uint8_t                        Reserved10[0x18];
  __IO  uint32_t                       USBHS_PHY44;        /**< Offset: 0x1544 (R/W  32) USBHPHY Control Register. */
  __IO  uint32_t                       USBHS_PHY48;        /**< Offset: 0x1548 (R/W  32) USBHPHY Control Register. */
  __IO  uint32_t                       USBHS_PHY4C;        /**< Offset: 0x154C (R/W  32) USBHPHY Control Register. */
  __IO  uint32_t                       USBHS_PHY50;        /**< Offset: 0x1550 (R/W  32) USBHPHY Control Register. */
} usbhs_endpointx_registers_t;

#define USBHS_TXFUNADDR_NUMBER 8

